'''
日期：2019年6月16日
作者：我的脚很小
目的：做一个随机从字库中显示字的程序让孩子跟着念
'''
import random, time

ziku = ['山','对','雨','云','虫','石','月','田','火','禾','水','站','耳','足','做','日','手','下','目','五','上','口','四','七','八',
        '九','十','六','我','地','它','天','他','人','她','你','风','了','子','虫','家','伞','穿','国','爱','门','飞','尖','长','儿',
        '黑','白','蓝','黄','绿','小','鸟','花','你','和','我','工','妈','爸','哥','姐','弟','妹','乌','马','牙','的','又','和','才',
        '出','个','好','红','中','心','土','不','女','男','天','皮','桌','纸','画','打','棋','鸡','字','词','语','句','苗','海','雷',
        '朋','明','水','空','早','时']

for i in range(len(ziku)):
    print(ziku[random.randint(0,len(ziku))-1])
    time.sleep(3)